; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_9 ?v13 ?v11)
             (pred_6 ?v1 ?v9)
             (pred_4 ?v13 ?v9)
             (pred_1 ?v6 ?v13 )
	     (pred_7 ?v13)
             (pred_11 ?v4)
             (pred_12 ?v1)
             (pred_5 ?v9)
             (pred_10 ?v13)
             (pred_8 ?v1)
             (pred_2 ?v13)
             (pred_3 ))



(:action op_3
:parameters (?v5 ?v3 ?v7 ?v8)
:precondition (and (pred_11 ?v5) (pred_11 ?v3) (pred_12 ?v7) (pred_5 ?v8)
          (pred_9 ?v5 ?v3) (pred_6 ?v7 ?v8)
                   (pred_4 ?v3 ?v8) (pred_7 ?v5) 
                   (pred_10 ?v3) (pred_8 ?v7))
:effect (and  (pred_2 ?v3) (not (pred_10 ?v3))))


(:action op_2
:parameters (?v5 ?v12)
:precondition (and (pred_11 ?v5) (pred_11 ?v12)
               (pred_7 ?v5) (pred_9 ?v5 ?v12) (pred_2 ?v12))
:effect (and (pred_7 ?v12) (not (pred_7 ?v5))))

(:action op_5
:parameters (?v5 ?v7)
:precondition (and (pred_11 ?v5) (pred_12 ?v7) 
                  (pred_7 ?v5) (pred_1 ?v7 ?v5) (pred_3 ))
:effect (and (pred_8 ?v7)
   (not (pred_1 ?v7 ?v5)) (not (pred_3 ))))


(:action op_4
:parameters (?v5 ?v2 ?v10)
:precondition (and (pred_11 ?v5) (pred_12 ?v2) (pred_12 ?v10)
                  (pred_7 ?v5) (pred_8 ?v10) (pred_1 ?v2 ?v5))
:effect (and (pred_8 ?v2) (pred_1 ?v10 ?v5)
        (not (pred_8 ?v10)) (not (pred_1 ?v2 ?v5))))

(:action op_1
:parameters (?v5 ?v7)
:precondition (and (pred_11 ?v5) (pred_12 ?v7) 
                  (pred_7 ?v5) (pred_8 ?v7))
:effect (and (pred_3 ) (pred_1 ?v7 ?v5) (not (pred_8 ?v7)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_30 obj_08 obj_04 obj_19 obj_28 obj_26 obj_05 obj_29 obj_20 obj_17 obj_31 obj_03 obj_25 obj_24 obj_11 obj_14 obj_09 obj_06 obj_12 obj_15 obj_13 obj_10 obj_23 obj_18 obj_27
    obj_22 obj_21 obj_01
    obj_16 obj_02 obj_07
    )

    (:init
       (pred_3)

       (pred_11 obj_30)
       (pred_11 obj_08)
       (pred_11 obj_04)
       (pred_11 obj_19)
       (pred_11 obj_28)
       (pred_11 obj_26)
       (pred_11 obj_05)
       (pred_11 obj_29)
       (pred_11 obj_20)
       (pred_11 obj_17)
       (pred_11 obj_31)
       (pred_11 obj_03)
       (pred_11 obj_25)
       (pred_11 obj_24)
       (pred_11 obj_11)
       (pred_11 obj_14)
       (pred_11 obj_09)
       (pred_11 obj_06)
       (pred_11 obj_12)
       (pred_11 obj_15)
       (pred_11 obj_13)
       (pred_11 obj_10)
       (pred_11 obj_23)
       (pred_11 obj_18)
       (pred_11 obj_27)
       (pred_5 obj_22)
       (pred_5 obj_21)
       (pred_5 obj_01)
       (pred_12 obj_16)
       (pred_12 obj_02)
       (pred_12 obj_07)

       (pred_9 obj_30 obj_26)
       (pred_9 obj_30 obj_08)
       (pred_9 obj_08 obj_05)
       (pred_9 obj_08 obj_04)
       (pred_9 obj_08 obj_30)
       (pred_9 obj_04 obj_29)
       (pred_9 obj_04 obj_19)
       (pred_9 obj_04 obj_08)
       (pred_9 obj_19 obj_20)
       (pred_9 obj_19 obj_28)
       (pred_9 obj_19 obj_04)
       (pred_9 obj_28 obj_17)
       (pred_9 obj_28 obj_19)
       (pred_9 obj_26 obj_31)
       (pred_9 obj_26 obj_05)
       (pred_9 obj_26 obj_30)
       (pred_9 obj_05 obj_03)
       (pred_9 obj_05 obj_29)
       (pred_9 obj_05 obj_08)
       (pred_9 obj_05 obj_26)
       (pred_9 obj_29 obj_25)
       (pred_9 obj_29 obj_20)
       (pred_9 obj_29 obj_04)
       (pred_9 obj_29 obj_05)
       (pred_9 obj_20 obj_24)
       (pred_9 obj_20 obj_17)
       (pred_9 obj_20 obj_19)
       (pred_9 obj_20 obj_29)
       (pred_9 obj_17 obj_11)
       (pred_9 obj_17 obj_28)
       (pred_9 obj_17 obj_20)
       (pred_9 obj_31 obj_14)
       (pred_9 obj_31 obj_03)
       (pred_9 obj_31 obj_26)
       (pred_9 obj_03 obj_09)
       (pred_9 obj_03 obj_25)
       (pred_9 obj_03 obj_05)
       (pred_9 obj_03 obj_31)
       (pred_9 obj_25 obj_06)
       (pred_9 obj_25 obj_24)
       (pred_9 obj_25 obj_29)
       (pred_9 obj_25 obj_03)
       (pred_9 obj_24 obj_12)
       (pred_9 obj_24 obj_11)
       (pred_9 obj_24 obj_20)
       (pred_9 obj_24 obj_25)
       (pred_9 obj_11 obj_15)
       (pred_9 obj_11 obj_17)
       (pred_9 obj_11 obj_24)
       (pred_9 obj_14 obj_13)
       (pred_9 obj_14 obj_09)
       (pred_9 obj_14 obj_31)
       (pred_9 obj_09 obj_10)
       (pred_9 obj_09 obj_06)
       (pred_9 obj_09 obj_03)
       (pred_9 obj_09 obj_14)
       (pred_9 obj_06 obj_23)
       (pred_9 obj_06 obj_12)
       (pred_9 obj_06 obj_25)
       (pred_9 obj_06 obj_09)
       (pred_9 obj_12 obj_18)
       (pred_9 obj_12 obj_15)
       (pred_9 obj_12 obj_24)
       (pred_9 obj_12 obj_06)
       (pred_9 obj_15 obj_27)
       (pred_9 obj_15 obj_11)
       (pred_9 obj_15 obj_12)
       (pred_9 obj_13 obj_10)
       (pred_9 obj_13 obj_14)
       (pred_9 obj_10 obj_23)
       (pred_9 obj_10 obj_09)
       (pred_9 obj_10 obj_13)
       (pred_9 obj_23 obj_18)
       (pred_9 obj_23 obj_06)
       (pred_9 obj_23 obj_10)
       (pred_9 obj_18 obj_27)
       (pred_9 obj_18 obj_12)
       (pred_9 obj_18 obj_23)
       (pred_9 obj_27 obj_15)
       (pred_9 obj_27 obj_18)
       (pred_10 obj_19)
       (pred_10 obj_15)
       (pred_10 obj_13)
       (pred_4  obj_19 obj_22)
       (pred_4  obj_15 obj_21)
       (pred_4  obj_13 obj_01)
       (pred_2 obj_30)
       (pred_2 obj_08)
       (pred_2 obj_04)
       (pred_2 obj_28)
       (pred_2 obj_26)
       (pred_2 obj_05)
       (pred_2 obj_29)
       (pred_2 obj_20)
       (pred_2 obj_17)
       (pred_2 obj_31)
       (pred_2 obj_03)
       (pred_2 obj_25)
       (pred_2 obj_24)
       (pred_2 obj_11)
       (pred_2 obj_14)
       (pred_2 obj_09)
       (pred_2 obj_06)
       (pred_2 obj_12)
       (pred_2 obj_10)
       (pred_2 obj_23)
       (pred_2 obj_18)
       (pred_2 obj_27)

       (pred_6  obj_16 obj_22)
       (pred_6  obj_02 obj_21)
       (pred_6  obj_07 obj_01)
       (pred_1 obj_16 obj_05)
       (pred_1 obj_02 obj_24)
       (pred_1 obj_07 obj_28)
       (pred_7 obj_27)
    )

    (:goal (and
       (pred_1 obj_16 obj_30)
       (pred_1 obj_02 obj_29)
    ))
(:constraints
  (always (not (pred_7 obj_12)))
)
)

; plan
1. (op_2 obj_27 obj_18)
   deleted: (pred_7 obj_27)
   added: (pred_7 obj_18)
   goals met: 0 of 2
2. (op_2 obj_18 obj_23)
   deleted: (pred_7 obj_18)
   added: (pred_7 obj_23)
   goals met: 0 of 2
3. (op_2 obj_23 obj_06)
   deleted: (pred_7 obj_23)
   added: (pred_7 obj_06)
   goals met: 0 of 2
4. (op_2 obj_06 obj_25)
   deleted: (pred_7 obj_06)
   added: (pred_7 obj_25)
   goals met: 0 of 2
5. (op_2 obj_25 obj_24)
   deleted: (pred_7 obj_25)
   added: (pred_7 obj_24)
   goals met: 0 of 2
6. (op_5 obj_24 obj_02)
   deleted: (pred_1 obj_02 obj_24) (pred_3)
   added: (pred_8 obj_02)
   goals met: 0 of 2
7. (op_2 obj_24 obj_20)
   deleted: (pred_7 obj_24)
   added: (pred_7 obj_20)
   goals met: 0 of 2
8. (op_2 obj_20 obj_29)
   deleted: (pred_7 obj_20)
   added: (pred_7 obj_29)
   goals met: 0 of 2
9. (op_1 obj_29 obj_02)
   deleted: (pred_8 obj_02)
   added: (pred_3) (pred_1 obj_02 obj_29)
   goals met: 1 of 2
10. (op_2 obj_29 obj_05)
   deleted: (pred_7 obj_29)
   added: (pred_7 obj_05)
   goals met: 1 of 2
11. (op_5 obj_05 obj_16)
   deleted: (pred_1 obj_16 obj_05) (pred_3)
   added: (pred_8 obj_16)
   goals met: 1 of 2
12. (op_2 obj_05 obj_08)
   deleted: (pred_7 obj_05)
   added: (pred_7 obj_08)
   goals met: 1 of 2
13. (op_2 obj_08 obj_30)
   deleted: (pred_7 obj_08)
   added: (pred_7 obj_30)
   goals met: 1 of 2
14. (op_1 obj_30 obj_16)
   deleted: (pred_8 obj_16)
   added: (pred_3) (pred_1 obj_16 obj_30)
   goals met: 2 of 2
